Дефинирайте масив, който пази информация за пет града - имената им, година на основане/Y/, население /число//P/, брой предприятия/NF/, брой спортни зали/SH/, брой културни мероприятия годишно/CA/, годишен приход на глава от население/YI/. Изчислете за всеки град индексът му растеж по формулата TIG = (((NF+SH)/CA)*100)*P/CA)(2019-Y) и добавете този коефициент към информацията, която съхранявате в масива за всеки град.
Намерете средния TIG за всички градове, за които имате информация в масива и го отпечатайте.
Отпечатайте информацията, която съхранявате в масива под формата на таблица, като всяка колона трябва да има название – име, година на основаване, население и т. н.
Намерете и отпечатайте името на града с най-нисък TIG. 15 т.

<?php

$arr = [
	['name'=>'city1', 'Y'=>1780, 'P'=>20000,'NF'=>15,'SH'=>5,'CA'=>30, 'YI'=>15000],
	['name'=>'city2', 'Y'=>1840, 'P'=>30000,'NF'=>25,'SH'=>8,'CA'=>45, 'YI'=>17000],
	['name'=>'city3', 'Y'=>1860, 'P'=>50000,'NF'=>50,'SH'=>12,'CA'=>50, 'YI'=>25000],
	['name'=>'city4', 'Y'=>1900, 'P'=>70000,'NF'=>60,'SH'=>15,'CA'=>55, 'YI'=>30000],
	['name'=>'city5', 'Y'=>1920, 'P'=>40000,'NF'=>14,'SH'=>10,'CA'=>20, 'YI'=>20000],
];
$count = count($arr);
for ($i=0; $i <$count ; $i++) { 
	$tig = (((($arr[$i]['NF']+$arr[$i]['SH'])/$arr[$i]['CA'])*100)*$arr[$i]['P']/$arr[$i]['CA'])*(2019 - $arr[$i]['Y']);
	$arr[$i]['TIG']=$tig;
	echo $tig;
	# code...
}
$avr_tig=$arr[$i]['TIG']/5;
echo$avr_tig;
//var_dump($arr);
echo"<table border=1>";
echo "<tr>";
echo "<td> Име </td>";
echo "<td> Година на основаване </td>";
echo "<td>Население </td>";
echo "<td> Предприятия </td>";
echo "<td> Спортни зали</td>";
echo "<td> Културни мероприятия </td>";
echo "<td>Годишен приход </td>";
echo "<td>Индекс на растеж</td>";
echo "</tr>";

for ($i=0; $i < $count; $i++) { 
	echo "<tr>";
	foreach ($arr[$i]  as $value) {
		echo "<td> $value </td>";
		# code...
	}

	# code...
}



